benchmarks/v1-single-threaded/ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /
Document Length:        31425 bytes

Concurrency Level:      100
Time taken for tests:   70.492 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      32512000 bytes
HTML transferred:       31425000 bytes
Requests per second:    14.19 [#/sec] (mean)
Time per request:       7049.175 [ms] (mean)
Time per request:       70.492 [ms] (mean, across all concurrent requests)
Transfer rate:          450.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0       4
Processing:    79 6132 1130.7   6409    7191
Waiting:       60 6118 1130.7   6393    7174
Total:         83 6133 1129.7   6409    7191

Percentage of the requests served within a certain time (ms)
  50%   6409
  66%   6579
  75%   6672
  80%   6723
  90%   6961
  95%   7043
  98%   7147
  99%   7170
 100%   7191 (longest request)