benchmarks/v1-single-threaded/ab.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8000

Document Path:          /
Document Length:        31425 bytes

Concurrency Level:      100
Time taken for tests:   31.751 seconds
Complete requests:      1000
Failed requests:        3
   (Connect: 0, Receive: 0, Length: 3, Exceptions: 0)
Total transferred:      32512150 bytes
HTML transferred:       31425150 bytes
Requests per second:    31.49 [#/sec] (mean)
Time per request:       3175.118 [ms] (mean)
Time per request:       31.751 [ms] (mean, across all concurrent requests)
Transfer rate:          999.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       3
Processing:    23 2658 806.9   2648    3843
Waiting:       22 2656 806.8   2644    3842
Total:         26 2658 806.6   2648    3843

Percentage of the requests served within a certain time (ms)
  50%   2648
  66%   3096
  75%   3341
  80%   3494
  90%   3662
  95%   3754
  98%   3809
  99%   3825
 100%   3843 (longest request)