benchmarks/v1-single-threaded/wrk.txt
Running 10s test @ http://localhost:8000/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.11s   516.73ms   1.98s    57.89%
    Req/Sec    12.73      9.69    50.00     77.39%
  356 requests in 10.03s, 11.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 299
Requests/sec:     35.51
Transfer/sec:      1.10MB